<?php


//资源
//对象
//数组 (复合数据类型)


// 索引数组
$a = [];

$a = array('你好', '你不还', '如花', '凤姐');

print_r($a);


print_r($a[3]);

$b = ['赵丽颖', '杨幂', '柳岩', '蔡徐坤'];

print_r($b[3]);

$c = '';

$c = [
    '大哥',
    ['小黑', '阿黄'],
    1234,
    true,
    array('小花', '铁牛', '二狗')
];
print_r($c);
print_r($c[1][1]);
$c[5] = '小美';
$c[6] = ['花花', '小猫咪'];

$c[] = '胡铁蛋';

print_r($c);

unset($c[2]);
$c[] = '慕容复';
$c[2] = '小明';
$c[4][] = ['刘亦菲', '抹茶妹妹'];
print_r($c);


// 关联数组
// 数组的键可以自由的定制

$d = [
    'name' => '张三',
    'age' => 18,
    'sex' => '男',
    3 => '哈哈哈哈',
    'hobby' => [
        '游泳',
        '画画'
    ]
];

$d['你爸爸'] = '李刚';

$d[] = '你爷爷叫书生';

print_r($d);




foreach ($d as $v){
    print_r($v);
}

foreach ($d as $k=>$v){
    print_r('<br>');
    print_r($k. '------');
    print_r($v);
}

// 索引数组使用任何遍历方式都行
for ($i = 0; $i<count($c); $i++){
    print_r('<br>');
    print_r($i. '------');
    print_r($c[$i]);
}








































